yonatan1t/dma-conf-tool/db/mcu/memory/STM32_DIE486_4200_0.xml
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<rzone xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="0.2.0" xs:noNamespaceSchemaLocation="AMC_rzone.xsd">

  <device Dname="STM32N6" Dvendor="STMicroelectronics:13" info="ARM Cortex-M55, 4200 KB RAM">
    <package info="STMicroelectronics STM32N6 Series Device Support" name="STM32N6xx_DFP" url="http://www.st.com/" vendor="STMicroelectronics" version="0.0.1-dev1"/>
    <processor Dclock="400000000" Dcore="ARM Cortex-M55" DcoreVersion="r0_p1" Ddsp="DSP" Dendian="Little-endian" DnumInterrupts="208" Dmpu="MPU" DnumMpuRegions="32" DnumSecMpuRegions="16" DnumSauRegions="8"/>
  </device>

  <resources>
    <sau_init>
      <region start="0x08000000" size="0x04000000" security="n" info="Non-Secure Code"/>
      <region start="0x20000000" size="0x10000000" security="n" info="Non-Secure RAM"/>
      <region start="0x40000000" size="0x10000000" security="n" info="Non-Secure Peripherals"/>
    </sau_init>
    <memories>    

	  <memory access="rwx" info="ITCM" security="c" name="ITCM_S" physical="0x00000000" size="0x00010000" start="0x10000000" type="RAM"/>
	  <memory access="rwx" info="DTCM" security="c" name="DTCM_S" physical="0x20000000" size="0x00020000" start="0x30000000" type="RAM"/>
	  <memory access="rwx" info="AXI SRAM1" name="SRAM1_S" physical="0x24000000" security="c" size="0x00100000" start="0x34000000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM2" name="SRAM2_S" physical="0x24100000" security="c" size="0x00100000" start="0x34100000" type="RAM"/>
	  <memory access="rwx" info="AXI SRAM3" name="SRAM3_S" physical="0x24200000" security="c" size="0x00070000" start="0x34200000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM4" name="SRAM4_S" physical="0x24270000" security="c" size="0x00070000" start="0x34270000" type="RAM"/>
	  <memory access="rwx" info="AXI SRAM5" name="SRAM5_S" physical="0x242E0000" security="c" size="0x00070000" start="0x342E0000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM6" name="SRAM6_S" physical="0x24350000" security="c" size="0x00070000" start="0x34350000" type="RAM"/>
	  <memory access="rwx" info="AHB_SRAM1" name="AHB_SRAM1_S" physical="0x28000000" security="c" size="0x00004000" start="0x38000000" type="RAM"/>
	  <memory access="rwx" info="AHB_SRAM2" name="AHB_SRAM2_S" physical="0x28004000" security="c" size="0x00004000" start="0x38004000" type="RAM"/>
	  <memory access="rwx" info="Backup SRAM" name="BackUp_SRAM_S" physical="0x2C000000" security="c" size="0x00002000" start="0x3C000000" type="RAM"/>
	  <memory access="rwx" info="ITCM" security="n" name="ITCM_NS" size="0x00010000" start="0x00000000" type="RAM"/>
	  <memory access="rwx" info="DTCM" security="n" name="DTCM_NS" size="0x00020000" start="0x20000000" type="RAM"/>
	  <memory access="rwx" info="AXI SRAM1" name="SRAM1_NS" security="n" size="0x00100000" start="0x24000000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM2" name="SRAM2_NS" security="n" size="0x00100000" start="0x24100000" type="RAM"/>
	  <memory access="rwx" info="AXI SRAM3" name="SRAM3_NS" security="n" size="0x00070000" start="0x24200000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM4" name="SRAM4_NS" security="n" size="0x00070000" start="0x24270000" type="RAM"/>
	  <memory access="rwx" info="AXI SRAM5" name="SRAM5_NS" security="n" size="0x00070000" start="0x242E0000" type="RAM"/>
      <memory access="rwx" info="AXI SRAM6" name="SRAM6_NS" security="n" size="0x00070000" start="0x24350000" type="RAM"/>
	  <memory access="rwx" info="AHB_SRAM1" name="AHB_SRAM1_NS" security="n" size="0x00004000" start="0x28000000" type="RAM"/>
	  <memory access="rwx" info="AHB_SRAM2" name="AHB_SRAM2_NS" security="n" size="0x00004000" start="0x28004000" type="RAM"/>
	  <memory access="rwx" info="Backup SRAM" name="BackUp_SRAM_NS" security="n" size="0x00002000" start="0x2C000000" type="RAM"/>
	  
	  <provisioning info="FMC Bank1" name="FMC_NOR_Bank1" size="0x10000000" start="0x60000000"/>
      <provisioning info="XSPI2" name="XSPI2" size="0x10000000" start="0x70000000"/> 
	  <provisioning info="XSPI3" name="XSPI3" size="0x10000000" start="0x80000000"/>
      <provisioning info="XSPI1" name="XSPI1" size="0x10000000" start="0x90000000"/>

      <provisioning info="FMC SDRAM Bank1" name="FMC_SDRAM_Bank1" size="0x10000000" start="0xC0000000"/>
      <provisioning info="FMC SDRAM Bank2" name="FMC_SDRAM_Bank2" size="0x10000000" start="0xD0000000"/>
    </memories>

   </resources>

</rzone>
